## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_storage_account.rcm_adls_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account" "rcm_adls_key" {
      + access_tier                        = (known after apply)
      + account_kind                       = (known after apply)
      + account_replication_type           = (known after apply)
      + account_tier                       = (known after apply)
      + allow_nested_items_to_be_public    = (known after apply)
      + azure_files_authentication         = (known after apply)
      + custom_domain                      = (known after apply)
      + dns_endpoint_type                  = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + identity                           = (known after apply)
      + infrastructure_encryption_enabled  = (known after apply)
      + is_hns_enabled                     = (known after apply)
      + location                           = (known after apply)
      + name                               = "vjrcmdevstorage"
      + nfsv3_enabled                      = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + queue_encryption_key_type          = (known after apply)
      + resource_group_name                = "vj-rcm-dev-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + table_encryption_key_type          = (known after apply)
      + tags                               = (known after apply)
    }

  # azuread_application_registration.rcm_adf_app will be created
  + resource "azuread_application_registration" "rcm_adf_app" {
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "vj-rcm-dev-adf-app"
      + id                             = (known after apply)
      + object_id                      = (known after apply)
      + publisher_domain               = (known after apply)
      + requested_access_token_version = 2
      + sign_in_audience               = "AzureADMyOrg"
    }

  # azuread_application_registration.rcm_adls_app will be created
  + resource "azuread_application_registration" "rcm_adls_app" {
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "vj-rcm-dev-adls-app"
      + id                             = (known after apply)
      + object_id                      = (known after apply)
      + publisher_domain               = (known after apply)
      + requested_access_token_version = 2
      + sign_in_audience               = "AzureADMyOrg"
    }

  # azuread_service_principal.azure_adf_sp will be created
  + resource "azuread_service_principal" "azure_adf_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.azure_adls_sp will be created
  + resource "azuread_service_principal" "azure_adls_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_data_factory.rcm_adf will be created
  + resource "azurerm_data_factory" "rcm_adf" {
      + id                     = (known after apply)
      + location               = "swedencentral"
      + name                   = "vj-rcm-dev-adf"
      + public_network_enabled = true
      + resource_group_name    = "vj-rcm-dev-rg"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be created
  + resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
      + data_factory_id      = (known after apply)
      + id                   = (known after apply)
      + name                 = "vj-rcm-dev-adls-ls"
      + storage_account_key  = (sensitive value)
      + url                  = "https://vjrcmdevstorage.dfs.core.windows.net/"
      + use_managed_identity = false
    }

  # azurerm_data_factory_linked_service_key_vault.rcm_kv_ls will be created
  + resource "azurerm_data_factory_linked_service_key_vault" "rcm_kv_ls" {
      + data_factory_id = (known after apply)
      + id              = (known after apply)
      + key_vault_id    = (known after apply)
      + name            = "vj-rcm-dev-kv-ls"
    }

  # azurerm_data_factory_linked_service_sql_server.rcm_sqldb_ls will be created
  + resource "azurerm_data_factory_linked_service_sql_server" "rcm_sqldb_ls" {
      + connection_string = "Integrated Security=False;Data Source = vjrcmdevsql.database.windows.net ;Initial Catalog=@{linkedService().db_name};User ID=azuresqladmin"
      + data_factory_id   = (known after apply)
      + id                = (known after apply)
      + name              = "vj-rcm-dev-sqldb-ls"
      + parameters        = {
          + "db_name" = "string"
        }
      + user_name         = "azuresqladmin"

      + key_vault_password {
          + linked_service_name = "vj-rcm-dev-kv-ls"
          + secret_name         = "vj-sqldb-access-key-dev"
        }
    }

  # azurerm_databricks_workspace.rcm_adb will be created
  + resource "azurerm_databricks_workspace" "rcm_adb" {
      + customer_managed_key_enabled      = false
      + disk_encryption_set_id            = (known after apply)
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + location                          = "swedencentral"
      + managed_disk_identity             = (known after apply)
      + managed_resource_group_id         = (known after apply)
      + managed_resource_group_name       = (known after apply)
      + name                              = "vj-rcm-dev-adb"
      + public_network_access_enabled     = true
      + resource_group_name               = "vj-rcm-dev-rg"
      + sku                               = "standard"
      + storage_account_identity          = (known after apply)
      + tags                              = {
          + "Environment" = "Staging"
        }
      + workspace_id                      = (known after apply)
      + workspace_url                     = (known after apply)

      + custom_parameters (known after apply)
    }

  # azurerm_key_vault.rcm_kv will be created
  + resource "azurerm_key_vault" "rcm_kv" {
      + access_policy                 = [
          + {
              + key_permissions     = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "Decrypt",
                  + "Encrypt",
                  + "UnwrapKey",
                  + "WrapKey",
                  + "Verify",
                  + "Sign",
                  + "Purge",
                  + "Release",
                  + "Rotate",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                ]
              + object_id           = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
              + secret_permissions  = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "Purge",
                ]
              + storage_permissions = [
                  + "Backup",
                  + "Delete",
                  + "DeleteSAS",
                  + "Get",
                  + "GetSAS",
                  + "List",
                  + "ListSAS",
                  + "Purge",
                  + "Recover",
                  + "RegenerateKey",
                  + "Restore",
                  + "Set",
                  + "SetSAS",
                  + "Update",
                ]
              + tenant_id           = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vj-rcm-dev-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "vj-rcm-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_secret.rcm_adls_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_adls_kv" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.rcm_sqldb_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_sqldb_kv" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-sqldb-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-a"] will be created
  + resource "azurerm_mssql_database" "rcm_db" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "vj-rcm-hos-a"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = (known after apply)
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-b"] will be created
  + resource "azurerm_mssql_database" "rcm_db" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "vj-rcm-hos-b"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = (known after apply)
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_firewall_rule.rcm_fw will be created
  + resource "azurerm_mssql_firewall_rule" "rcm_fw" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "FirewallRule1"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.rcm_server will be created
  + resource "azurerm_mssql_server" "rcm_server" {
      + administrator_login                  = "azuresqladmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "swedencentral"
      + minimum_tls_version                  = "1.2"
      + name                                 = "vjrcmdevsql"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "vj-rcm-dev-rg"
      + restorable_dropped_database_ids      = (known after apply)
      + version                              = "12.0"
    }

  # azurerm_resource_group.rcm_rg will be created
  + resource "azurerm_resource_group" "rcm_rg" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "vj-rcm-dev-rg"
    }

  # azurerm_storage_account.rcm_adls will be created
  + resource "azurerm_storage_account" "rcm_adls" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "RAGRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = "vjrcmdevstorage"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "vj-rcm-dev-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.rcm_container["bronze"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bronze"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.rcm_container["configs"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "configs"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.rcm_container["gold"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "gold"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.rcm_container["landing"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "landing"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.rcm_container["silver"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "silver"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.rcm_container["tfstate"] will be created
  + resource "azurerm_storage_container" "rcm_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "tfstate"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # random_password.admin_password[0] will be created
  + resource "random_password" "admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```
</details>